# 연산자 : 데이터를 가공하거나 비교하거나 판단하기 위함
# 산술연산자 : +, -, *, /, %(나머지), //(몫), **(거듭제곱)
# 관계연산자 : ==, 1=, >(초과), <(미만), >=(이상,이후), <=(이하,이전)
# 논리연산자 : and, or, not
# 대입연산자 : =, (a,b), *(packaging)


# 17 / 5 => 3.4
# 17 % 5 => 2
# 17 // 5 => 3


# (a,b) = (40, 50)

# a = 30 , b = 20
# (a,b) = (30, 20)
# (a,b) = (b,a)  => (20,30)

# a = 20
# b = 30
# c = 40
# b > a and b > c  ------> 두 조건 모두 만족해야 True, 아니면 False
# or ----> 둘 중 하나라도 만족 하면 True 아니면 False
# not ----> 참을 거짓으로 거짓을 참으로 바꾸는 명령어


a = 6
b = 7
print("더하기 : ", a+b)
print("빼기 : ", a-b)
print("곱하기 : ", a*b)
print("나누기 : ", a/b)
print("나머지 : ", a%b)
print("몫 : ", a//b)
print("제곱 : ", a**b)

